tap "homebrew/core"
# C++ Common Libraries
brew "abseil"
# Download with resuming and segmented downloading
brew "aria2"
# Utility to check whether MAC addresses are already taken on a LAN
brew "arping"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# GNU binary tools for native development
brew "binutils"
# Collection of portable C++ source libraries
brew "boost"
# Formatting tools for C, C++, Obj-C, Java, JavaScript, TypeScript
brew "clang-format"
# Statistics utility to count lines of code
brew "cloc"
# Cross-platform make
brew "cmake"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Lint commit messages according to a commit convention
brew "commitlint"
# Filename encoding conversion tool
brew "convmv"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Diff that understands syntax
brew "difftastic"
# File comparison utilities
brew "diffutils"
# Convert text between DOS, UNIX, and Mac formats
brew "dos2unix"
# C++ template library for linear algebra
brew "eigen"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Utility to determine file types
brew "file-formula"
# Collection of GNU find, xargs, and locate
brew "findutils"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# GNU compiler collection
brew "gcc"
# Interpreted, interactive, object-oriented programming language
brew "python"
# Reports from gcov test coverage program
brew "gcovr"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Run gitlab pipelines locally as shell executor or docker executor
brew "gitlab-ci-local"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU version of the tar archiving utility
brew "gnu-tar"
# GNU implementation of time utility
brew "gnu-time"
# GNU unit conversion tool
brew "gnu-units"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Google Testing and Mocking Framework
brew "googletest"
# GNU grep, egrep and fgrep
brew "grep"
# Popular GNU data compression program
brew "gzip"
# Improved top (interactive process viewer)
brew "htop"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c@77"
# Display an interface's bandwidth usage
brew "iftop"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# CLI wrapper for basic network utilities on macOS - ip command
brew "iproute2mac"
# Manage your Java environment
brew "jenv"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Highly capable, feature-rich programming language
brew "perl"
# Add indentation to LaTeX files
brew "latexindent"
# Parallel bzip2 utility
brew "lbzip2"
# Pager program similar to more
brew "less"
# Next-gen compiler infrastructure
brew "llvm"
# Utility for directing compilation
brew "make"
# Fast Cross-Platform Package Manager
brew "micromamba"
# Lightweight PDF and XPS viewer
brew "mupdf"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Small build system for use with gyp or CMake
brew "ninja"
# Open-source, cross-platform JavaScript runtime environment
brew "node@20"
# Chemical toolbox
brew "open-babel"
# Development kit for the Java programming language
brew "openjdk@11"
# OpenBSD freely-licensed SSH connectivity tools
brew "openssh"
# Shell command parallelization utility
brew "parallel"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Show ps output as a tree
brew "pstree"
# Monitor data's progress through a pipe
brew "pv"
# Password generator
brew "pwgen"
# Seamless operability between C++11 and Python
brew "pybind11"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Visualize data generated by Cachegrind and Calltree
brew "qcachegrind"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Utility that provides fast incremental file transfer
brew "rsync"
# Rust toolchain installer
brew "rustup"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Autoformat shell script source code
brew "shfmt"
# SMART hard drive monitoring
brew "smartmontools"
# SOcket CAT: netcat on steroids
brew "socat"
# Header-only C++ library for large scale eigenvalue problems
brew "spectra"
# Soak up standard input and write to a file
brew "sponge"
# Add a public key to a remote machine's authorized_keys file
brew "ssh-copy-id"
# High-performance system programming language
brew "swift"
# Formatting technology for Swift source code
brew "swift-format"
# Very fast implementation of tldr in Rust
brew "tealdeer", link: false
# User interface to the TELNET protocol
brew "telnet"
# Official tldr client written in Rust
brew "tlrc"
# Terminal multiplexer
brew "tmux"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Config manager based on git
brew "vcsh"
# Vi 'workalike' with many additional features
brew "vim"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Display word differences between text files
brew "wdiff"
# Internet file retriever
brew "wget"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Programming language designed for robustness, optimality, and clarity
brew "zig"
# Language Server for Zig
brew "zls"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Transfer files from and to an Android smartphone
cask "android-file-transfer"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Display management tool
cask "betterdisplay"
# Utility to create and modify archives
cask "betterzip"
# Virtual Audio Driver
cask "blackhole-2ch"
# Terminal-based AI coding assistant
cask "claude-code"
# Tool to show live information about the batteries in various devices
cask "coconutbattery"
# OpenAI's coding agent that runs in your terminal
cask "codex"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# UI toolkit for building applications for mobile, web and desktop
cask "flutter"
# Download manager with a torrent client
cask "folx"
cask "font-computer-modern"
cask "font-d2coding"
cask "font-dejavu"
cask "font-hack"
cask "font-nanum-gothic"
cask "font-nanum-myeongjo"
cask "font-nanum-square"
cask "font-new-york"
cask "font-noto-sans-cjk"
cask "font-noto-serif-cjk-kr"
cask "font-pretendard"
cask "font-roboto"
cask "font-sf-compact"
cask "font-sf-mono"
cask "font-sf-pro"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Menu bar manager
cask "jordanbaird-ice"
# Quick Look plugin for Jupyter notebooks
cask "jupyter-notebook-ql"
# Keyboard customiser
cask "karabiner-elements"
# Open-source keystroke visualiser
cask "keycastr"
# Clipboard manager
cask "maccy"
# Controls and monitors all fans on Apple computers
cask "macs-fan-control"
# Full TeX Live distribution without GUI applications
cask "mactex-no-gui"
# Audio converter
cask "mediahuman-audio-converter"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# Firewall app
cask "murus"
# App to write, plan, collaborate, and get organised
cask "notion"
# Quick Look plugin for plaintext files without an extension
cask "qlstephen"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Print driver for printing documents directly to a pdf file
cask "rwts-pdfwriter"
# Text editor for code, markup and prose
cask "sublime-text"
# Replacement for RCDefaultApps, written in Swift
cask "swiftdefaultappsprefpane"
# Keyboard configurator
cask "via"
# Multimedia player
cask "vlc"
# Network protocol analyzer
cask "wireshark-app"
# Open-source version of the X.Org X Window System
cask "xquartz"
