tap "eddieantonio/eddieantonio"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
brew "aria2"
brew "bash"
brew "bat"
brew "binutils"
brew "clang-format"
brew "cmake"
brew "convmv"
brew "coreutils"
brew "curl"
brew "fd"
brew "findutils"
brew "fzf"
brew "gawk"
brew "gcc"
brew "gh"
brew "git"
brew "git-flow-avh"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-time"
brew "gnu-units"
brew "grep"
brew "gzip"
brew "htop"
brew "icu4c"
brew "iftop"
brew "openssl@1.1"
brew "iproute2mac"
brew "perl"
brew "latexindent"
brew "lbzip2"
brew "less"
brew "lesspipe"
brew "llvm"
brew "make"
brew "neofetch"
brew "neovim"
brew "open-babel"
brew "openssh"
brew "pre-commit"
brew "pstree"
brew "python@3.10"
brew "rename"
brew "ripgrep"
brew "rsync"
brew "rustup-init"
brew "shellcheck"
brew "shfmt"
brew "socat"
brew "ssh-copy-id"
brew "swift-format"
brew "tmux"
brew "vcsh"
brew "vim"
brew "watch"
brew "wget"
brew "youtube-dl"
brew "zsh"
brew "eddieantonio/eddieantonio/unormalize"
cask "balenaetcher"
cask "betterzip"
cask "cheatsheet"
cask "coconutbattery"
cask "dozer"
cask "folx"
cask "font-computer-modern"
cask "font-d2coding"
cask "font-dejavu"
cask "font-hack"
cask "font-new-york"
cask "font-noto-sans-cjk"
cask "font-sf-compact"
cask "font-sf-mono"
cask "font-sf-pro"
cask "grammarly-desktop"
cask "iterm2"
cask "jupyter-notebook-ql"
cask "karabiner-elements"
cask "keycastr"
cask "macs-fan-control"
cask "mactex-no-gui"
cask "mediahuman-audio-converter"
cask "monitorcontrol"
cask "musescore"
cask "nightowl"
cask "qlstephen"
cask "rectangle"
cask "rwts-pdfwriter"
cask "sublime-text"
cask "swiftdefaultappsprefpane"
cask "transmission"
cask "vlc"
cask "wxmacmolplt"
cask "xquartz"
vscode "13xforever.language-x86-64-assembly"
vscode "adpyke.codesnap"
vscode "ArianJamasb.protein-viewer"
vscode "batisteo.vscode-django"
vscode "benspaulding.python-manifest-template"
vscode "bierner.github-markdown-preview"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-footnotes"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bierner.markdown-yaml-preamble"
vscode "bodil.prettier-toml"
vscode "bradlc.vscode-tailwindcss"
vscode "Cardinal90.multi-cursor-case-preserve"
vscode "charliermarsh.ruff"
vscode "codezombiech.gitignore"
vscode "coolbear.systemd-unit-file"
vscode "cschlosser.doxdocgen"
vscode "DavidAnson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "dgileadi.java-decompiler"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "evgeniypeshkov.syntax-highlighter"
vscode "fortran-lang.linter-gfortran"
vscode "foxundermoon.shell-format"
vscode "GitHub.codespaces"
vscode "GitHub.copilot-chat"
vscode "GitHub.copilot-labs"
vscode "GitHub.copilot-nightly"
vscode "GitHub.remotehub"
vscode "github.vscode-github-actions"
vscode "GitHub.vscode-pull-request-github"
vscode "golang.go"
vscode "IBM.output-colorizer"
vscode "James-Yu.latex-workshop"
vscode "jasonlhy.hungry-delete"
vscode "jock.svg"
vscode "kevinkyang.auto-comment-blocks"
vscode "KevinRose.vsc-python-indent"
vscode "leonhard-s.python-sphinx-highlight"
vscode "lextudio.restructuredtext"
vscode "liviuschera.noctis"
vscode "llvm-vs-code-extensions.vscode-clangd"
vscode "mads-hartmann.bash-ide-vscode"
vscode "maelvalais.autoconf"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.sublime-keybindings"
vscode "njpwerner.autodocstring"
vscode "redhat.fabric8-analytics"
vscode "redhat.java"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "richie5um2.vscode-sort-json"
vscode "ritwickdey.LiveServer"
vscode "rust-lang.rust-analyzer"
vscode "samubarb.vscode-doxyfile"
vscode "shardulm94.trailing-spaces"
vscode "sswg.swift-lang"
vscode "streetsidesoftware.code-spell-checker"
vscode "tamasfe.even-better-toml"
vscode "tecosaur.latex-utilities"
vscode "timonwong.shellcheck"
vscode "tintinweb.vscode-decompiler"
vscode "torn4dom4n.latex-support"
vscode "trond-snekvik.simple-rst"
vscode "ultram4rine.vscode-choosealicense"
vscode "usernamehw.indent-one-space"
vscode "vadimcn.vscode-lldb"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vittorioromeo.expand-selection-to-scope"
vscode "vknabel.vscode-apple-swift-format"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-maven"
vscode "webfreak.debug"
vscode "wmaurer.change-case"
vscode "wybxc.hcl-syntax-highlight"
vscode "ymotongpoo.licenser"
vscode "yzhang.markdown-all-in-one"
